In [1]:
import pandas as pd
df_titanic = pd.read_csv("train.csv")

df_titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
#Kazada ölenlerin yaş ortalaması

olen_yasort = df_titanic[df_titanic["Survived"] == 0]["Age"].mean()
olen_yasort

30.62617924528302

In [3]:

#2.Kazada ölenlerin bilet fiyatlarının ortalamasını ve medyanını bulunuz

olenler = df_titanic[df_titanic["Survived"] == 0]
olen_ucret_ort = olenler["Fare"].mean()
olen_ucret_medyan = olenler["Fare"].median()

olen_ucret_ort, olen_ucret_medyan

(22.117886885245902, 10.5)

In [4]:
#3. Kazada ölen erkeklerin yaş ortalamasını bulunuz

olen_erkekler = df_titanic[(df_titanic["Survived"] == 0) & (df_titanic["Sex"] == "male")]
olen_erkek_yas_ort = olen_erkekler["Age"].mean()

olen_erkek_yas_ort

31.618055555555557

In [5]:
#4. Kazada ölen kadınların yaş ortalamasını bulunuz

olen_kadinlar = df_titanic[(df_titanic["Survived"] == 0) & (df_titanic["Sex"] == "female")]
olen_kadin_yas_ort = olen_kadinlar["Age"].mean()

olen_kadin_yas_ort

25.046875

In [6]:
#5. Kazadan kurtulanların yaş ortalamasını bulunuz

kurtulanlar = df_titanic[df_titanic["Survived"] == 1]
kurtulan_yas_ort = kurtulanlar["Age"].mean()

kurtulan_yas_ort

28.343689655172415

In [7]:
#6. Kazadan kurtulanların bilet fiyatlarının ortalamasını bulunuz

kurtulan_ucret_ort = kurtulanlar["Fare"].mean()

kurtulan_ucret_ort

48.39540760233918

In [8]:
#7. Kazadan kurtulan toplam kişi sayısını bulunuz

kurtulan_sayi = len(df_titanic[df_titanic["Survived"] == 1])
kurtulan_sayi

342

In [9]:
#8. 10 yaşından küçüklerin bilet fiyatlarının medyan değerini bulunuz

cocuklar = df_titanic[df_titanic["Age"] < 10]
cocuk_ucret_medyan = cocuklar["Fare"].median()

cocuk_ucret_medyan

27.0

In [10]:
#9. 1., 2. ve 3. sınıf bilet fiyatlarının ortalama ve medyanlarını karşılaştırınız

sinif_ucret_ozet = df_titanic.groupby("Pclass")["Fare"].agg(["mean", "median"])
sinif_ucret_ozet

             mean   median
Pclass
1       84.154687  60.2875
2       20.662183  14.2500
3       13.675550   8.0500

In [12]:
#10. Kazada ölen kadınların oranı ile erkeklerin oranını karşılaştırınız

# Erkekler
tum_erkekler = df_titanic[df_titanic["Sex"] == "male"]
olen_erkekler = tum_erkekler[tum_erkekler["Survived"] == 0]
olen_erkek_oran = len(olen_erkekler) / len(tum_erkekler)

# Kadınlar
tum_kadinlar = df_titanic[df_titanic["Sex"] == "female"]
olen_kadinlar = tum_kadinlar[tum_kadinlar["Survived"] == 0]
olen_kadin_oran = len(olen_kadinlar) / len(tum_kadinlar)

olen_erkek_oran, olen_kadin_oran

(0.8110918544194108, 0.25796178343949044)